In [1]:
import pandas as pd

In [54]:
import json
j_string = '''[
    {
        "id":1,
        "name":"Tejas",
        "degree":"BE",
        "year":3,
        "sem":5,
        "contact":93980169981,
        "Branch":"ECE"
    },
    {
        "id":2,
        "name":"Naveen",
        "degree":"BE",
        "year":3,
        "sem":5,
        "contact":8277438279,
        "Branch":"ECE"
    },
    {
        "id":3,
        "name":"Anupam",
        "degree":"BE",
        "year":3,
        "sem":5,
        "contact":7875797412,
        "Branch":"MEC"
    },
    {
        "id":4,
        "name":"Krish",
        "degree":"BE",
        "year":3,
        "sem":5,
        "contact":6532789241,
        "Branch":"MEC"
    }
]
'''
jss = json.loads(j_string)
keys = []
ids = []
names = []
degrees = []
years = []
sems = []
contacts = []
branches = []
for js in jss:
    for k in js.keys():
        if k in keys:
            continue
        keys.append(k)
    for k,v in js.items():
        if k == 'id':
            ids.append(v)
        elif k == 'name':
            names.append(v)
        elif k == 'degree':
            degrees.append(v)
        elif k == 'year':
            years.append(v)
        elif k == 'sem':
            sems.append(v)
        elif k == 'contact':
            contacts.append(v)
        else:
            branches.append(v)
print(branches)
data = pd.DataFrame({'id':ids,'name':names,'degree':degrees,'year':years,'sem':sems,'branch':branches,'contact':contacts})
data = data.rename(columns={'id':'USN','name':'Name'})

['ECE', 'ECE', 'MEC', 'MEC']

   USN    Name degree  year  sem branch      contact
0    1   Tejas     BE     3    5    ECE  93980169981
1    2  Naveen     BE     3    5    ECE   8277438279
2    3  Anupam     BE     3    5    MEC   7875797412
3    4   Krish     BE     3    5    MEC   6532789241

In [3]:
data = data.rename_axis("Students", axis='rows').rename_axis("details", axis='columns')
data

details   USN    Name degree  year  sem branch      contact
Students
0           1   Tejas     BE     3    5    ECE  93980169981
1           2  Naveen     BE     3    5    ECE   8277438279
2           3  Anupam     BE     3    5    MEC   7875797412
3           4   Krish     BE     3    5    MEC   6532789241

In [4]:
data.to_csv("data.csv")

In [5]:
data

details   USN    Name degree  year  sem branch      contact
Students
0           1   Tejas     BE     3    5    ECE  93980169981
1           2  Naveen     BE     3    5    ECE   8277438279
2           3  Anupam     BE     3    5    MEC   7875797412
3           4   Krish     BE     3    5    MEC   6532789241

In [6]:
data.groupby("USN").Name.min()

USN
1     Tejas
2    Naveen
3    Anupam
4     Krish
Name: Name, dtype: object

In [7]:
import pytz
country_name = []
country_full_names = []
timezones = []
for k,v in pytz.country_timezones.items():
    if k in country_name or v in timezones:
        continue
    country_name.append(k)
    timezones.append(v)
for k,v in pytz.country_names.items():
    country_full_names.append(v)
print(len(country_full_names))
print(len(timezones))
country_full_names.remove('Britain (UK)')
country_full_names.remove('Micronesia')
print(len(country_full_names))

249
247
247

In [37]:
data = pd.DataFrame({'country_name':country_full_names,'timezones':timezones}, index=country_name)
data

            country_name              timezones
AD               Andorra       [Europe/Andorra]
AE  United Arab Emirates           [Asia/Dubai]
AF           Afghanistan           [Asia/Kabul]
AG     Antigua & Barbuda      [America/Antigua]
AI              Anguilla     [America/Anguilla]
..                   ...                    ...
YE                 Yemen            [Asia/Aden]
YT               Mayotte       [Indian/Mayotte]
ZA          South Africa  [Africa/Johannesburg]
ZM                Zambia        [Africa/Lusaka]
ZW              Zimbabwe        [Africa/Harare]

[247 rows x 2 columns]

In [41]:
data = data.rename_axis('short_codes',axis='rows')
data

                     country_name              timezones
short_codes
AD                        Andorra       [Europe/Andorra]
AE           United Arab Emirates           [Asia/Dubai]
AF                    Afghanistan           [Asia/Kabul]
AG              Antigua & Barbuda      [America/Antigua]
AI                       Anguilla     [America/Anguilla]
...                           ...                    ...
YE                          Yemen            [Asia/Aden]
YT                        Mayotte       [Indian/Mayotte]
ZA                   South Africa  [Africa/Johannesburg]
ZM                         Zambia        [Africa/Lusaka]
ZW                       Zimbabwe        [Africa/Harare]

[247 rows x 2 columns]

In [42]:
data.to_csv('timezones.csv')

In [16]:
database = pd.read_csv('id,name,email,files,file_data.csv', index_col=0)

In [17]:
database.head()

,name,email,files,file_data
id,,,,
1,Tejas,tejasnandam88614@gmail.com,WIN_20200117_22_42_19_Pro.jpg,����
2,Nandam,nandamtejas1306@gmail.com,NANDAM TEJAS 1MV18EC057 NEFT receipt.pdf,%PDF-1.6\r\n%����\r\n8 0 obj\r\n<</Linearized ...
3,Riposte,Riposte@gmail.com,RIPOSTE DANCE CREW.mp4,NaN
4,Riposte 2,Riposte@gmail.com,TRIM_TIPTIP_BMC.mp4,NaN

In [50]:
database.groupby('name').email.agg([len,min,max])

            len                         min                         max
name
Nandam        1   nandamtejas1306@gmail.com   nandamtejas1306@gmail.com
Riposte       1           Riposte@gmail.com           Riposte@gmail.com
Riposte 2     1           Riposte@gmail.com           Riposte@gmail.com
Tejas         1  tejasnandam88614@gmail.com  tejasnandam88614@gmail.com